nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxe247/driver_examples/trgmux/clone_pwm/pin_mux.h
/*
 * Copyright 2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void);

/*! @name PORTE10 (number 6), LPSPI2_PCS1
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITTRGMUXPINS_LPSPI2_PCS1_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITTRGMUXPINS_LPSPI2_PCS1_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITTRGMUXPINS_LPSPI2_PCS1_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PORTE16 (number 1), LPSPI2_SIN
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITTRGMUXPINS_LPSPI2_SIN_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITTRGMUXPINS_LPSPI2_SIN_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITTRGMUXPINS_LPSPI2_SIN_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitTrgmuxPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
